HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PINBWKP */
#define IFX_PMS_PMSWSTAT2_PINBWKP_OFF (3u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PWRWKP */
#define IFX_PMS_PMSWSTAT2_PWRWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PWRWKP */
#define IFX_PMS_PMSWSTAT2_PWRWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PWRWKP */
#define IFX_PMS_PMSWSTAT2_PWRWKP_OFF (4u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.SCRWKP */
#define IFX_PMS_PMSWSTAT2_SCRWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.SCRWKP */
#define IFX_PMS_PMSWSTAT2_SCRWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.SCRWKP */
#define IFX_PMS_PMSWSTAT2_SCRWKP_OFF (5u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PORSTWKP */
#define IFX_PMS_PMSWSTAT2_PORSTWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PORSTWKP */
#define IFX_PMS_PMSWSTAT2_PORSTWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PORSTWKP */
#define IFX_PMS_PMSWSTAT2_PORSTWKP_OFF (6u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.WUTWKP */
#define IFX_PMS_PMSWSTAT2_WUTWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.WUTWKP */
#define IFX_PMS_PMSWSTAT2_WUTWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.WUTWKP */
#define IFX_PMS_PMSWSTAT2_WUTWKP_OFF (7u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.ESR0OVRUN */
#define IFX_PMS_PMSWSTAT2_ESR0OVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.ESR0OVRUN */
#define IFX_PMS_PMSWSTAT2_ESR0OVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.ESR0OVRUN */
#define IFX_PMS_PMSWSTAT2_ESR0OVRUN_OFF (8u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.ESR1OVRUN */
#define IFX_PMS_PMSWSTAT2_ESR1OVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.ESR1OVRUN */
#define IFX_PMS_PMSWSTAT2_ESR1OVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.ESR1OVRUN */
#define IFX_PMS_PMSWSTAT2_ESR1OVRUN_OFF (9u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PINAOVRUN */
#define IFX_PMS_PMSWSTAT2_PINAOVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PINAOVRUN */
#define IFX_PMS_PMSWSTAT2_PINAOVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PINAOVRUN */
#define IFX_PMS_PMSWSTAT2_PINAOVRUN_OFF (10u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PINBOVRUN */
#define IFX_PMS_PMSWSTAT2_PINBOVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PINBOVRUN */
#define IFX_PMS_PMSWSTAT2_PINBOVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PINBOVRUN */
#define IFX_PMS_PMSWSTAT2_PINBOVRUN_OFF (11u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.VDDSTBYEN */
#define IFX_PMS_PMSWSTAT2_VDDSTBYEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.VDDSTBYEN */
#define IFX_PMS_PMSWSTAT2_VDDSTBYEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.VDDSTBYEN */
#define IFX_PMS_PMSWSTAT2_VDDSTBYEN_OFF (12u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.SCROVRUN */
#define IFX_PMS_PMSWSTAT2_SCROVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.SCROVRUN */
#define IFX_PMS_PMSWSTAT2_SCROVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.SCROVRUN */
#define IFX_PMS_PMSWSTAT2_SCROVRUN_OFF (13u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PORSTOVRUN */
#define IFX_PMS_PMSWSTAT2_PORSTOVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PORSTOVRUN */
#define IFX_PMS_PMSWSTAT2_PORSTOVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PORSTOVRUN */
#define IFX_PMS_PMSWSTAT2_PORSTOVRUN_OFF (14u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.WUTOVRUN */
#define IFX_PMS_PMSWSTAT2_WUTOVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.WUTOVRUN */
#define IFX_PMS_PMSWSTAT2_WUTOVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.WUTOVRUN */
#define IFX_PMS_PMSWSTAT2_WUTOVRUN_OFF (15u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.STBYRAM */
#define IFX_PMS_PMSWSTAT2_STBYRAM_LEN (3u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.STBYRAM */
#define IFX_PMS_PMSWSTAT2_STBYRAM_MSK (0x7u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.STBYRAM */
#define IFX_PMS_PMSWSTAT2_STBYRAM_OFF (16u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.VEXTSTBYEN */
#define IFX_PMS_PMSWSTAT2_VEXTSTBYEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.VEXTSTBYEN */
#define IFX_PMS_PMSWSTAT2_VEXTSTBYEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.VEXTSTBYEN */
#define IFX_PMS_PMSWSTAT2_VEXTSTBYEN_OFF (19u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.BLNKFIL */
#define IFX_PMS_PMSWSTAT2_BLNKFIL_LEN (4u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.BLNKFIL */
#define IFX_PMS_PMSWSTAT2_BLNKFIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.BLNKFIL */
#define IFX_PMS_PMSWSTAT2_BLNKFIL_OFF (20u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.ESR0WKEN */
#define IFX_PMS_PMSWSTAT2_ESR0WKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.ESR0WKEN */
#define IFX_PMS_PMSWSTAT2_ESR0WKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.ESR0WKEN */
#define IFX_PMS_PMSWSTAT2_ESR0WKEN_OFF (24u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.ESR1WKEN */
#define IFX_PMS_PMSWSTAT2_ESR1WKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.ESR1WKEN */
#define IFX_PMS_PMSWSTAT2_ESR1WKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.ESR1WKEN */
#define IFX_PMS_PMSWSTAT2_ESR1WKEN_OFF (25u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PINAWKEN */
#define IFX_PMS_PMSWSTAT2_PINAWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PINAWKEN */
#define IFX_PMS_PMSWSTAT2_PINAWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PINAWKEN */
#define IFX_PMS_PMSWSTAT2_PINAWKEN_OFF (26u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PINBWKEN */
#define IFX_PMS_PMSWSTAT2_PINBWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PINBWKEN */
#define IFX_PMS_PMSWSTAT2_PINBWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PINBWKEN */
#define IFX_PMS_PMSWSTAT2_PINBWKEN_OFF (27u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PWRWKEN */
#define IFX_PMS_PMSWSTAT2_PWRWKEN_LEN (1u)

