HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_EVRSDCTRL6_Bits.SINCLO */
#define IFX_PMS_EVRSDCTRL6_SINCLO_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL6_Bits.SINCHI */
#define IFX_PMS_EVRSDCTRL6_SINCHI_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL6_Bits.SINCHI */
#define IFX_PMS_EVRSDCTRL6_SINCHI_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL6_Bits.SINCHI */
#define IFX_PMS_EVRSDCTRL6_SINCHI_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCTRL6_Bits.LCK */
#define IFX_PMS_EVRSDCTRL6_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL6_Bits.LCK */
#define IFX_PMS_EVRSDCTRL6_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL6_Bits.LCK */
#define IFX_PMS_EVRSDCTRL6_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.DRVNI */
#define IFX_PMS_EVRSDCTRL7_DRVNI_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.DRVNI */
#define IFX_PMS_EVRSDCTRL7_DRVNI_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.DRVNI */
#define IFX_PMS_EVRSDCTRL7_DRVNI_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.DRVPCBF */
#define IFX_PMS_EVRSDCTRL7_DRVPCBF_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.DRVPCBF */
#define IFX_PMS_EVRSDCTRL7_DRVPCBF_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.DRVPCBF */
#define IFX_PMS_EVRSDCTRL7_DRVPCBF_OFF (2u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.DRVP */
#define IFX_PMS_EVRSDCTRL7_DRVP_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.DRVP */
#define IFX_PMS_EVRSDCTRL7_DRVP_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.DRVP */
#define IFX_PMS_EVRSDCTRL7_DRVP_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.DRVSLOMODE */
#define IFX_PMS_EVRSDCTRL7_DRVSLOMODE_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.DRVSLOMODE */
#define IFX_PMS_EVRSDCTRL7_DRVSLOMODE_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.DRVSLOMODE */
#define IFX_PMS_EVRSDCTRL7_DRVSLOMODE_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.DRVSPR */
#define IFX_PMS_EVRSDCTRL7_DRVSPR_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.DRVSPR */
#define IFX_PMS_EVRSDCTRL7_DRVSPR_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.DRVSPR */
#define IFX_PMS_EVRSDCTRL7_DRVSPR_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.SYNCDIVFAC */
#define IFX_PMS_EVRSDCTRL7_SYNCDIVFAC_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.SYNCDIVFAC */
#define IFX_PMS_EVRSDCTRL7_SYNCDIVFAC_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.SYNCDIVFAC */
#define IFX_PMS_EVRSDCTRL7_SYNCDIVFAC_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.LCK */
#define IFX_PMS_EVRSDCTRL7_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.LCK */
#define IFX_PMS_EVRSDCTRL7_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.LCK */
#define IFX_PMS_EVRSDCTRL7_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.FBADCOFFS */
#define IFX_PMS_EVRSDCTRL8_FBADCOFFS_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.FBADCOFFS */
#define IFX_PMS_EVRSDCTRL8_FBADCOFFS_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.FBADCOFFS */
#define IFX_PMS_EVRSDCTRL8_FBADCOFFS_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.FBADCSMP */
#define IFX_PMS_EVRSDCTRL8_FBADCSMP_LEN (6u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.FBADCSMP */
#define IFX_PMS_EVRSDCTRL8_FBADCSMP_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.FBADCSMP */
#define IFX_PMS_EVRSDCTRL8_FBADCSMP_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.FBADCBLNK */
#define IFX_PMS_EVRSDCTRL8_FBADCBLNK_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.FBADCBLNK */
#define IFX_PMS_EVRSDCTRL8_FBADCBLNK_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.FBADCBLNK */
#define IFX_PMS_EVRSDCTRL8_FBADCBLNK_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.FBADCLPF */
#define IFX_PMS_EVRSDCTRL8_FBADCLPF_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.FBADCLPF */
#define IFX_PMS_EVRSDCTRL8_FBADCLPF_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.FBADCLPF */
#define IFX_PMS_EVRSDCTRL8_FBADCLPF_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.FBADCERR */
#define IFX_PMS_EVRSDCTRL8_FBADCERR_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.FBADCERR */
#define IFX_PMS_EVRSDCTRL8_FBADCERR_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.FBADCERR */
#define IFX_PMS_EVRSDCTRL8_FBADCERR_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.FBADCLSB */
#define IFX_PMS_EVRSDCTRL8_FBADCLSB_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.FBADCLSB */
#define IFX_PMS_EVRSDCTRL8_FBADCLSB_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.FBADCLSB */
#define IFX_PMS_EVRSDCTRL8_FBADCLSB_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.LCK */
#define IFX_PMS_EVRSDCTRL8_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.LCK */
#define IFX_PMS_EVRSDCTRL8_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.LCK */
#define IFX_PMS_EVRSDCTRL8_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL9_Bits.FFADCOFFS */
#define IFX_PMS_EVRSDCTRL9_FFADCOFFS_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL9_Bits.FFADCOFFS */
#define IFX_PMS_EVRSDCTRL9_FFADCOFFS_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL9_Bits.FFADCOFFS */
#define IFX_PMS_EVRSDCTRL9_FFADCOFFS_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL9_Bits.FFADCLPF */
#define IFX_PMS_EVRSDCTRL9_FFADCLPF_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL9_Bits.FFADCLPF */
#define IFX_PMS_EVRSDCTRL9_FFADCLPF_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL9_Bits.FFADCLPF */
#define IFX_PMS_EVRSDCTRL9_FFADCLPF_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL9_Bits.LCK */
#define IFX_PMS_EVRSDCTRL9_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL9_Bits.LCK */
#define IFX_PMS_EVRSDCTRL9_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL9_Bits.LCK */
#define IFX_PMS_EVRSDCTRL9_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL10_Bits.SHVH */
#define IFX_PMS_EVRSDCTRL10_SHVH_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL10_Bits.SHVH */
#define IFX_PMS_EVRSDCTRL10_SHVH_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL10_Bits.SHVH */
#define IFX_PMS_EVRSDCTRL10_SHVH_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL10_Bits.SHVL */
#define IFX_PMS_EVRSDCTRL10_SHVL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL10_Bits.SHVL */
#define IFX_PMS_EVRSDCTRL10_SHVL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL10_Bits.SHVL */
#define IFX_PMS_EVRSDCTRL10_SHVL_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL10_Bits.SHHVEN */
#define IFX_PMS_EVRSDCTRL10_SHHVEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL10_Bits.SHHVEN */
#define IFX_PMS_EVRSDCTRL10_SHHVEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL10_Bits.SHHVEN */
#define IFX_PMS_EVRSDCTRL10_SHHVEN_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCTRL10_Bits.SHLVEN */
#define IFX_PMS_EVRSDCTRL10_SHLVEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL10_Bits.SHLVEN */
#define IFX_PMS_EVRSDCTRL10_SHLVEN_MSK (0x1u)

