HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxPms_bf.h
/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.M1S4COEFF */
#define IFX_PMS_EVRSDCOEFF2_M1S4COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.M1S4COEFF */
#define IFX_PMS_EVRSDCOEFF2_M1S4COEFF_OFF (12u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.M1SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF2_M1SRMPCOEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.M1SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF2_M1SRMPCOEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.M1SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF2_M1SRMPCOEFF_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.M1FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF2_M1FGETCOEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.M1FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF2_M1FGETCOEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.M1FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF2_M1FGETCOEFF_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.M1S2COEFF */
#define IFX_PMS_EVRSDCOEFF2_M1S2COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.M1S2COEFF */
#define IFX_PMS_EVRSDCOEFF2_M1S2COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.M1S2COEFF */
#define IFX_PMS_EVRSDCOEFF2_M1S2COEFF_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.M1S2VINSRC */
#define IFX_PMS_EVRSDCOEFF2_M1S2VINSRC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.M1S2VINSRC */
#define IFX_PMS_EVRSDCOEFF2_M1S2VINSRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.M1S2VINSRC */
#define IFX_PMS_EVRSDCOEFF2_M1S2VINSRC_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.M1S2VOSRC */
#define IFX_PMS_EVRSDCOEFF2_M1S2VOSRC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.M1S2VOSRC */
#define IFX_PMS_EVRSDCOEFF2_M1S2VOSRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.M1S2VOSRC */
#define IFX_PMS_EVRSDCOEFF2_M1S2VOSRC_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF3_Bits.M1VOCFLPF */
#define IFX_PMS_EVRSDCOEFF3_M1VOCFLPF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF3_Bits.M1VOCFLPF */
#define IFX_PMS_EVRSDCOEFF3_M1VOCFLPF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF3_Bits.M1VOCFLPF */
#define IFX_PMS_EVRSDCOEFF3_M1VOCFLPF_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF3_Bits.M1VOCFINC */
#define IFX_PMS_EVRSDCOEFF3_M1VOCFINC_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF3_Bits.M1VOCFINC */
#define IFX_PMS_EVRSDCOEFF3_M1VOCFINC_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF3_Bits.M1VOCFINC */
#define IFX_PMS_EVRSDCOEFF3_M1VOCFINC_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF3_Bits.M1VOUT */
#define IFX_PMS_EVRSDCOEFF3_M1VOUT_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF3_Bits.M1VOUT */
#define IFX_PMS_EVRSDCOEFF3_M1VOUT_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF3_Bits.M1VOUT */
#define IFX_PMS_EVRSDCOEFF3_M1VOUT_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF3_Bits.M1VIN */
#define IFX_PMS_EVRSDCOEFF3_M1VIN_LEN (11u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF3_Bits.M1VIN */
#define IFX_PMS_EVRSDCOEFF3_M1VIN_MSK (0x7ffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF3_Bits.M1VIN */
#define IFX_PMS_EVRSDCOEFF3_M1VIN_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF3_Bits.M1S3COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF3_M1S3COEFFFRAC_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF3_Bits.M1S3COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF3_M1S3COEFFFRAC_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF3_Bits.M1S3COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF3_M1S3COEFFFRAC_OFF (27u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF3_Bits.M1S2COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF3_M1S2COEFFFRAC_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF3_Bits.M1S2COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF3_M1S2COEFFFRAC_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF3_Bits.M1S2COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF3_M1S2COEFFFRAC_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF3_Bits.M1SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF3_M1SRMPCOEFFFRAC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF3_Bits.M1SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF3_M1SRMPCOEFFFRAC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF3_Bits.M1SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF3_M1SRMPCOEFFFRAC_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S0EN */
#define IFX_PMS_EVRSDCOEFF4_M2S0EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S0EN */
#define IFX_PMS_EVRSDCOEFF4_M2S0EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S0EN */
#define IFX_PMS_EVRSDCOEFF4_M2S0EN_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2EN */
#define IFX_PMS_EVRSDCOEFF4_M2S2EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2EN */
#define IFX_PMS_EVRSDCOEFF4_M2S2EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2EN */
#define IFX_PMS_EVRSDCOEFF4_M2S2EN_OFF (1u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3EN */
#define IFX_PMS_EVRSDCOEFF4_M2S3EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3EN */
#define IFX_PMS_EVRSDCOEFF4_M2S3EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3EN */
#define IFX_PMS_EVRSDCOEFF4_M2S3EN_OFF (2u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3CLIP */
#define IFX_PMS_EVRSDCOEFF4_M2S3CLIP_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3CLIP */
#define IFX_PMS_EVRSDCOEFF4_M2S3CLIP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3CLIP */
#define IFX_PMS_EVRSDCOEFF4_M2S3CLIP_OFF (3u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S4EN */
#define IFX_PMS_EVRSDCOEFF4_M2S4EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S4EN */
#define IFX_PMS_EVRSDCOEFF4_M2S4EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S4EN */
#define IFX_PMS_EVRSDCOEFF4_M2S4EN_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2RAMPEN */
#define IFX_PMS_EVRSDCOEFF4_M2RAMPEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2RAMPEN */
#define IFX_PMS_EVRSDCOEFF4_M2RAMPEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2RAMPEN */
#define IFX_PMS_EVRSDCOEFF4_M2RAMPEN_OFF (5u)

