HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxPms_bf.h
/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE1 */
#define IFX_PMS_AGFSP_STDBY1_FE1_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE1 */
#define IFX_PMS_AGFSP_STDBY1_FE1_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE1 */
#define IFX_PMS_AGFSP_STDBY1_FE1_OFF (1u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE2 */
#define IFX_PMS_AGFSP_STDBY1_FE2_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE2 */
#define IFX_PMS_AGFSP_STDBY1_FE2_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE2 */
#define IFX_PMS_AGFSP_STDBY1_FE2_OFF (2u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE3 */
#define IFX_PMS_AGFSP_STDBY1_FE3_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE3 */
#define IFX_PMS_AGFSP_STDBY1_FE3_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE3 */
#define IFX_PMS_AGFSP_STDBY1_FE3_OFF (3u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE4 */
#define IFX_PMS_AGFSP_STDBY1_FE4_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE4 */
#define IFX_PMS_AGFSP_STDBY1_FE4_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE4 */
#define IFX_PMS_AGFSP_STDBY1_FE4_OFF (4u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE5 */
#define IFX_PMS_AGFSP_STDBY1_FE5_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE5 */
#define IFX_PMS_AGFSP_STDBY1_FE5_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE5 */
#define IFX_PMS_AGFSP_STDBY1_FE5_OFF (5u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE7 */
#define IFX_PMS_AGFSP_STDBY1_FE7_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE7 */
#define IFX_PMS_AGFSP_STDBY1_FE7_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE7 */
#define IFX_PMS_AGFSP_STDBY1_FE7_OFF (7u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE8 */
#define IFX_PMS_AGFSP_STDBY1_FE8_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE8 */
#define IFX_PMS_AGFSP_STDBY1_FE8_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE8 */
#define IFX_PMS_AGFSP_STDBY1_FE8_OFF (8u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE9 */
#define IFX_PMS_AGFSP_STDBY1_FE9_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE9 */
#define IFX_PMS_AGFSP_STDBY1_FE9_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE9 */
#define IFX_PMS_AGFSP_STDBY1_FE9_OFF (9u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE10 */
#define IFX_PMS_AGFSP_STDBY1_FE10_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE10 */
#define IFX_PMS_AGFSP_STDBY1_FE10_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE10 */
#define IFX_PMS_AGFSP_STDBY1_FE10_OFF (10u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE11 */
#define IFX_PMS_AGFSP_STDBY1_FE11_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE11 */
#define IFX_PMS_AGFSP_STDBY1_FE11_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE11 */
#define IFX_PMS_AGFSP_STDBY1_FE11_OFF (11u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE12 */
#define IFX_PMS_AGFSP_STDBY1_FE12_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE12 */
#define IFX_PMS_AGFSP_STDBY1_FE12_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE12 */
#define IFX_PMS_AGFSP_STDBY1_FE12_OFF (12u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE13 */
#define IFX_PMS_AGFSP_STDBY1_FE13_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE13 */
#define IFX_PMS_AGFSP_STDBY1_FE13_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE13 */
#define IFX_PMS_AGFSP_STDBY1_FE13_OFF (13u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE14 */
#define IFX_PMS_AGFSP_STDBY1_FE14_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE14 */
#define IFX_PMS_AGFSP_STDBY1_FE14_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE14 */
#define IFX_PMS_AGFSP_STDBY1_FE14_OFF (14u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE15 */
#define IFX_PMS_AGFSP_STDBY1_FE15_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE15 */
#define IFX_PMS_AGFSP_STDBY1_FE15_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE15 */
#define IFX_PMS_AGFSP_STDBY1_FE15_OFF (15u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE16 */
#define IFX_PMS_AGFSP_STDBY1_FE16_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE16 */
#define IFX_PMS_AGFSP_STDBY1_FE16_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE16 */
#define IFX_PMS_AGFSP_STDBY1_FE16_OFF (16u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.BITPROT */
#define IFX_PMS_AGFSP_STDBY1_BITPROT_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.BITPROT */
#define IFX_PMS_AGFSP_STDBY1_BITPROT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.BITPROT */
#define IFX_PMS_AGFSP_STDBY1_BITPROT_OFF (30u)

/** \brief Length for Ifx_PMS_DTSSTAT_Bits.RESULT */
#define IFX_PMS_DTSSTAT_RESULT_LEN (12u)

/** \brief Mask for Ifx_PMS_DTSSTAT_Bits.RESULT */
#define IFX_PMS_DTSSTAT_RESULT_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_DTSSTAT_Bits.RESULT */
#define IFX_PMS_DTSSTAT_RESULT_OFF (0u)

/** \brief Length for Ifx_PMS_DTSLIM_Bits.LOWER */
#define IFX_PMS_DTSLIM_LOWER_LEN (12u)

/** \brief Mask for Ifx_PMS_DTSLIM_Bits.LOWER */
#define IFX_PMS_DTSLIM_LOWER_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_DTSLIM_Bits.LOWER */
#define IFX_PMS_DTSLIM_LOWER_OFF (0u)

/** \brief Length for Ifx_PMS_DTSLIM_Bits.LLU */
#define IFX_PMS_DTSLIM_LLU_LEN (1u)

/** \brief Mask for Ifx_PMS_DTSLIM_Bits.LLU */
#define IFX_PMS_DTSLIM_LLU_MSK (0x1u)

/** \brief Offset for Ifx_PMS_DTSLIM_Bits.LLU */
#define IFX_PMS_DTSLIM_LLU_OFF (15u)

/** \brief Length for Ifx_PMS_DTSLIM_Bits.UPPER */
#define IFX_PMS_DTSLIM_UPPER_LEN (12u)

/** \brief Mask for Ifx_PMS_DTSLIM_Bits.UPPER */
#define IFX_PMS_DTSLIM_UPPER_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_DTSLIM_Bits.UPPER */
#define IFX_PMS_DTSLIM_UPPER_OFF (16u)

/** \brief Length for Ifx_PMS_DTSLIM_Bits.SLCK */
#define IFX_PMS_DTSLIM_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_DTSLIM_Bits.SLCK */
#define IFX_PMS_DTSLIM_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_DTSLIM_Bits.SLCK */
#define IFX_PMS_DTSLIM_SLCK_OFF (30u)

